Autodesk.Revit.DB.Analysis.MassGBXMLExportOptions.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Constructs a new instance of the options used to export a mass model to gbXML.
massZoneIds:
Indicates the mass zones to analyze in the exported gbXML.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.MassGBXMLExportOptions.#ctor(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Constructs a new instance of the options used to export a mass model to gbXML.
massZoneIds:
Indicates the mass zones to analyze in the exported gbXML.
massIds:
Indicates the masses to use as shading surfaces in the exported gbXML--these masses must not have mass floors or mass zones so as not to end up with duplicate surface information in the gbXML output.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012